// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends.length >= 3) {
//     console.log('big');
// } else {
//     console.log('small')
// };

//
//
//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//
// let a = 11;
// let b = 23;
// let c = 42;
//
// if (a < b && c > b) {
//     console.log(b)
// } else {
//     console.log('error')
// };
//
// if ( a < b && b < c) {
//     console.log(b)
// } else {
//     console.log('error')
// };


//
// - Перепишіть конструкцію if з використанням умовного оператора '?':

// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let a = 1;
// let b = 2;
// let fun = (a + b < 4) ? 'мало' : 'багато';
// console.log(fun);


// let a = 3;
// let b = 8 ;
// let result = (a + b < 4) ? 'мало' : 'багато';
// console.log(result);

//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
// let num = 0;
// let res = (num === 0) ? 'zero' : (num >= -100 && num < 0) ? 'negative' : (num > 0 && num <= 100) ? 'positve' : 'error';
// console.log(res)


// let a = 45;
// //
// let result = (a >= -100 && a < 0) ? console.log('negative') :
//     (a > 0 && a < 100) ? console.log('positive') : (a === 0) ? console.log('zero') : console.log('error');

// let a = 6;
//
// let result = (a >= -100 && a < 0) ? console.log('negative') : (a <= 100 && a > 0) ? console.log('positive') :
//     (a === 0) ? console.log('zero') : console.log('error') ;
//

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//

// let awr = prompt('Яка «офіційна» назва JavaScript?');
//
// if (awr === 'ECMAScript' ) {
//     console.log('Right!')
// } else {
//     console.log('Не знаєте? ECMAScript')
// };

//
//
//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
// let pid = +prompt("У якому під'їзді знаходиться квартира?");
//
// if (pid >=1 && pid <=20) {
//     console.log('first');
// } else if (pid >=21 && pid <=48 ) {
//     console.log('seond');
// } else if (pid >=49 && pid <=90 ) {
//     console.log('third');
// } else {
//     console.log('error')
// };

//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let numb = 5;
//
// if (numb === 10) {
//     console.log(true)
// } else {
//     console.log(false)
// };
//

//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН


// let temp = 34;
//
// if (temp >=10 && temp <=22) {
//     console.log('Ідемо вчитися')
// } else {
//     console.log('Вчимося онлайн')
// }

//
//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
//
// switch (7) {
//     case 1 :
//         console.log('auto');
//         break;
//     case 2 :
//         console.log('moto');
//         break;
//
//     case 3 :
//         console.log('iPhone');
//         break;
//
//     case 4 :
//         console.log('Pencil');
//         break;
//
//     case 5 :
//         console.log('Rolex');
//         break;
//     default:
//         console.log('try again')
// }

