// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// function rect (a,b) {
//     return a*b;
// }
//
// console.log(rect (10,30));
// console.log(rect(100,20));

// - створити функцію яка обчислює та повертає площу кола з радіусом r

// function cir(PI, r) {
//     return PI * (r * r);
// }
//
// console.log(cir(3.14, 5));

//
/// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

// function cyl (R, h, PI) {
//     return 2*PI*R*(R+h);
// }
//
// console.log(cyl(5,15,3.14))


// - створити функцію яка приймає масив та виводить кожен його елемент
//
//

// let data= ['hello', 'okten', 134, true, false, null];
// let dataBase = ['SOME TEXT INSIDE'];
//
// function print (arr) {
//     for (const item of arr) {
//         console.log(item);
//     }
// }
//
// print(data);
// print(dataBase);
// //
//


// - створити функцію яка створює параграф з текстом. Текст задати через аргумент




// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13


// let num = [54,5,43,24,6,3,42,3,1];
//
// for (const number of num) {
//     if (num [i] > number) {
//         console.log(number)
//     }
// }
